SkyRocketToys/STM8TX/lib/beken.c
// -----------------------------------------------------------------------------
// driver for Beken BK2425 radio
// -----------------------------------------------------------------------------

#include "config.h"
#include "stm8l.h"
#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include "util.h"
#include "spi.h"
#include "gpio.h"
#include "telem_structure.h"
#include "beken.h"
#include "adc.h"
#include "crc.h"
#include "timer.h"
#include "channels.h"
#include "eeprom.h"

#if SUPPORT_BEKEN

#define SUPPORT_UART 1 // Output some info
enum {
	CHANNEL_DWELL_PACKETS =  1, ///< How many packets to send on the same frequency before changing
	CHANNEL_COUNT_LOGICAL = 16, ///< The maximum number of entries in each frequency table
	CHANNEL_BASE_TABLE    =  0, ///< The table used for non wifi boards
	CHANNEL_SAFE_TABLE    =  3, ///< A table that will receive packets even if wrong
	CHANNEL_NUM_TABLES    =  6, ///< The number of tables
	CHANNEL_COUNT_TEST    = 16, ///< The number of test mode tables
};

uint8_t dfu_buffer[128]; // Buffer for holding new firmware info until a write can be made.
uint16_t dfu_written = 0; // Positiion we have reached in writing (16 means first packet received)

/** \file */
/** \addtogroup beken Beken BK2425 radio module
@{ */

// ----------------------------------------------------------------------------
// Prototypes
void BK2425_ChangeChannel(uint8_t channelNumber);
uint8_t LookupChannel(uint8_t idx);
volatile uint16_t delta_send_packets;

// ----------------------------------------------------------------------------
// Packet format definition
// ----------------------------------------------------------------------------

/** The type of packets being sent between controller and drone */
enum BK_PKT_TYPE_E {
	BK_PKT_TYPE_INVALID      = 0,    ///< Invalid packet from empty packets or bad CRC
	BK_PKT_TYPE_CTRL_FOUND   = 0x10, ///< (Tx->Drone) User control - known receiver
	BK_PKT_TYPE_CTRL_LOST    = 0x11, ///< (Tx->Drone) User control - unknown receiver
	BK_PKT_TYPE_BIND_AUTO    = 0x12, ///< (Tx->Drone) Tell drones this tx is broadcasting
	BK_PKT_TYPE_TELEMETRY    = 0x13, ///< (Drone->Tx) Send telemetry to tx
	BK_PKT_TYPE_DFU          = 0x14, ///< (Drone->Tx) Send new firmware to tx
	BK_PKT_TYPE_BIND_MANUAL  = 0x15, ///< (Tx->Drone) Tell drones this tx is broadcasting
};
typedef uint8_t BK_PKT_TYPE;

/** The type of info being sent in control packets */
#if 0
enum BK_INFO_TYPE_E {
	BK_INFO_MIN = 1,
	BK_INFO_FW_VER = 1,
	BK_INFO_DFU_RX = 2,
	BK_INFO_FW_CRC_LO = 3,
	BK_INFO_FW_CRC_HI = 4,
	BK_INFO_FW_YM = 5,
	BK_INFO_FW_DAY = 6,
	BK_INFO_MODEL = 7,
	BK_INFO_PPS = 8,
	BK_INFO_BATTERY = 9,
	BK_INFO_COUNTDOWN = 10, // Countdown to wifi change
	BK_INFO_HOPPING = 11, // Countdown to hopping change
	BK_INFO_MAX
};
#endif
typedef uint8_t BK_INFO_TYPE;

/** Data for packets that are not droneid packets
	Onair order = little-endian */
typedef struct packetDataDeviceCtrl_s {
	uint8_t roll;     ///< Low 8 bits of the roll joystick (in mode2)
	uint8_t pitch;    ///< Low 8 bits of the pitch joystick (in mode2)
	uint8_t throttle; ///< Low 8 bits of the throttle joystick (in mode2)
	uint8_t yaw;      ///< Low 8 bits of the yaw joystick (in mode2)
	uint8_t msb;      ///< High 2 bits of roll (7..6), pitch (5..4), throttle (3..2), yaw (1..0) (in mode2)
	uint8_t buttons_held; ///< The buttons
	uint8_t buttons_toggled; ///< The buttons
	uint8_t data_type; ///< Type of extra data being sent
	uint8_t data_value_lo; ///< Value of extra data being sent
	uint8_t data_value_hi; ///< Value of extra data being sent
} packetDataDeviceCtrl;

enum { SZ_ADDRESS = 5 }; ///< Size of address for transmission packets (40 bits)
enum { SZ_CRC_GUID = 4 }; ///< Size of UUID for drone (32 bits)
enum { SZ_DFU = 16 }; ///< Size of DFU packets

/** Data for packets that are binding packets
	Onair order = little-endian */
typedef struct packetDataDeviceBind_s {
	uint8_t bind_address[SZ_ADDRESS]; ///< The address being used by control packets
	uint8_t hopping; ///< The hopping table in use for this connection
	uint8_t droneid[SZ_CRC_GUID]; ///< The CRC of the drone id I last received telemetry from, or 0.
} packetDataDeviceBind;

/** Data structure for data packet transmitted from device (controller) to host (drone) */
typedef struct packetDataDevice_s {
	BK_PKT_TYPE packetType; ///< The packet type
	uint8_t channel; ///< The channel this packet is being broadcast on
	union packetDataDevice_u ///< The variant part of the packets
	{
		packetDataDeviceCtrl ctrl; ///< Control packets
		packetDataDeviceBind bind; ///< Binding packets
	} u;
} packetFormatTx;

/** Data structure for data packet transmitted from host (drone) to device (controller) for telemetry.
    Compare with telem_packet_cc2500 and telem_packet_cypress */
typedef struct packetDataDrone_s {
	BK_PKT_TYPE packetType; ///< 0: The packet type
	uint8_t channel; ///< 1: The channel this packet is being broadcast on
	uint8_t pps; ///< 2: Packets per second the drone received
	uint8_t flags; ///< 3: Flags
	uint8_t droneid[SZ_CRC_GUID]; ///< 4...7: CRC of the drone
	uint8_t flight_mode; ///< 8:
	uint8_t wifi; ///< 9: Wifi channel + 24 * tx power.
	uint8_t note_adjust; ///< 10: note adjust for the tx buzzer (should this be sent so often?)
	uint8_t hopping; ///< 11: desired adaptive hopping table for even packets (0,2,4,6,8,10,12,14)
} packetFormatRx;

/** Data structure for data packet transmitted from host (drone) to device (controller) for over the air upgrades.
    Compare with telem_firmware */
typedef struct packetDataDfu_s {
	BK_PKT_TYPE packetType; ///< 0: The packet type
	uint8_t channel; ///< 1: Next channel I will broadcast on
	uint8_t address_lo; ///< 2:
	uint8_t address_hi; ///< 3:
	uint8_t data[SZ_DFU]; ///< 4...19:
} packetFormatDfu;

// ----------------------------------------------------------------------------
// ----------------------------------------------------------------------------


#define TX_SPEED 250u // Default transmit speed in kilobits per second.

#define PACKET_LENGTH_TX_CTRL 12
#define PACKET_LENGTH_TX_BIND 12
#define PACKET_LENGTH_RX_TELEMETRY 12
#define PACKET_LENGTH_RX_DFU 20
#define PACKET_LENGTH_RX_MAX 20

/** Channel hopping parameters. Values are in MHz from 2400Mhz. */
enum CHANNEL_MHZ_e {
	CHANNEL_MIN_PHYSICAL = 0, ///< Minimum physical channel that is possible
	CHANNEL_MAX_PHYSICAL = 83, ///< Maximum physical channel that is possible
	CHANNEL_FCC_LOW = 10, ///< Minimum physical channel that will pass the FCC tests
	CHANNEL_FCC_HIGH = 72, ///< Maximum physical channel that will pass the FCC tests
	CHANNEL_FCC_MID = 41, ///< A representative physical channel
};

/** The baud rate of the GFSK modulation */
typedef enum ITX_SPEED_e {
	ITX_250,  ///< 250kbps (slowest but furthest range)
	ITX_1000, ///< 1000kbps (balanced)
	ITX_2000, ///< 2000kbps (fastest hence least congested)
	ITX_CARRIER, ///< 0kbps carrier test
	ITX_MAX
} ITX_SPEED;

/** Flags for the STM8 hardware SPI registers */
typedef enum SPI_Flag_e {
	SPI_FLAG_BSY    = (uint8_t)0x80, /*!< Busy flag */
	SPI_FLAG_OVR    = (uint8_t)0x40, /*!< Overrun flag */
	SPI_FLAG_MODF   = (uint8_t)0x20, /*!< Mode fault */
	SPI_FLAG_CRCERR = (uint8_t)0x10, /*!< CRC error flag */
	SPI_FLAG_WKUP   = (uint8_t)0x08, /*!< Wake-up flag */
	SPI_FLAG_TXE    = (uint8_t)0x02, /*!< Transmit buffer empty */
	SPI_FLAG_RXNE   = (uint8_t)0x01  /*!< Receive buffer empty */
} SPI_Flag_TypeDef;

/** SPI register commands for the BK2425 and nrf24L01+ chips */
typedef enum BK_SPI_CMD_e {
// General commands
	BK_REG_MASK        = 0x1F,  ///< The range of registers that can be read and written
	BK_READ_REG        = 0x00,  ///< Define read command to register (0..1F)
	BK_WRITE_REG       = 0x20,  ///< Define write command to register (0..1F)
	BK_ACTIVATE_CMD	   = 0x50,  ///< Must NOT have BK_WRITE_REG added to it
	BK_R_RX_PL_WID_CMD = 0x60,
	BK_RD_RX_PLOAD     = 0x61,  ///< Define RX payload register address
	BK_WR_TX_PLOAD     = 0xA0,  ///< Define TX payload register address
	BK_W_ACK_PAYLOAD_CMD = 0xA8, ///< (nrf: +pipe 0..7)
	BK_W_TX_PAYLOAD_NOACK_CMD = 0xB0, ///<
	BK_FLUSH_TX        = 0xE1,  ///< Define flush TX register command
	BK_FLUSH_RX        = 0xE2,  ///< Define flush RX register command
	BK_REUSE_TX_PL     = 0xE3,  ///< Define reuse TX payload register command
	BK_NOP             = 0xFF,  ///< Define No Operation, might be used to read status register

// BK2425 bank 0 register addresses
	BK_CONFIG          = 0x00,  ///< 'Config' register address
	BK_EN_AA           = 0x01,  ///< 'Enable Auto Acknowledgment' register address
	BK_EN_RXADDR       = 0x02,  ///< 'Enabled RX addresses' register address
	BK_SETUP_AW        = 0x03,  ///< 'Setup address width' register address
	BK_SETUP_RETR      = 0x04,  ///< 'Setup Auto. Retrans' register address
	BK_RF_CH           = 0x05,  ///< 'RF channel' register address
	BK_RF_SETUP        = 0x06,  ///< 'RF setup' register address
	BK_STATUS          = 0x07,  ///< 'Status' register address
	BK_OBSERVE_TX      = 0x08,  ///< 'Observe TX' register address (lost packets, retransmitted packets on this frequency)
	BK_CD              = 0x09,  ///< 'Carrier Detect' register address
	BK_RX_ADDR_P0      = 0x0A,  ///< 'RX address pipe0' register address (5 bytes)
	BK_RX_ADDR_P1      = 0x0B,  ///< 'RX address pipe1' register address (5 bytes)
	BK_RX_ADDR_P2      = 0x0C,  ///< 'RX address pipe2' register address (1 byte)
	BK_RX_ADDR_P3      = 0x0D,  ///< 'RX address pipe3' register address (1 byte)
	BK_RX_ADDR_P4      = 0x0E,  ///< 'RX address pipe4' register address (1 byte)
	BK_RX_ADDR_P5      = 0x0F,  ///< 'RX address pipe5' register address (1 byte)
	BK_TX_ADDR         = 0x10,  ///< 'TX address' register address (5 bytes)
	BK_RX_PW_P0        = 0x11,  ///< 'RX payload width, pipe0' register address
	BK_RX_PW_P1        = 0x12,  ///< 'RX payload width, pipe1' register address
	BK_RX_PW_P2        = 0x13,  ///< 'RX payload width, pipe2' register address
	BK_RX_PW_P3        = 0x14,  ///< 'RX payload width, pipe3' register address
	BK_RX_PW_P4        = 0x15,  ///< 'RX payload width, pipe4' register address
	BK_RX_PW_P5        = 0x16,  ///< 'RX payload width, pipe5' register address
	BK_FIFO_STATUS     = 0x17,  ///< 'FIFO Status Register' register address
	BK_DYNPD           = 0x1c,  ///< 'Enable dynamic payload length' register address
	BK_FEATURE         = 0x1d,  ///< 'Feature' register address
	BK_PAYLOAD_WIDTH   = 0x1f,  ///< 'payload length of 256 bytes modes register address

// BK2425 bank 1 register addresses
	BK2425_R1_4      = 0x04, ///<
	BK2425_R1_5      = 0x05, ///<
	BK2425_R1_WHOAMI = 0x08, ///< Register to read that contains the chip id
	BK2425_R1_12     = 0x0C, ///< PLL speed 120 or 130us
	BK2425_R1_13     = 0x0D, ///<
	BK2425_R1_14     = 0x0E, ///<
} BK_SPI_CMD;

enum {
	BK_CHIP_ID_BK2425 = 0x63, ///< The expected value of reading BK2425_R1_WHOAMI
};

/** Meanings of the BK_STATUS register */
enum BK_STATUS_e {
	BK_STATUS_RBANK = 0x80, ///< Register bank 1 is in use
	BK_STATUS_RX_DR = 0x40, ///< Data ready
	BK_STATUS_TX_DS = 0x20, ///< Data sent
	BK_STATUS_MAX_RT = 0x10, ///< Max retries failed
	BK_STATUS_RX_MASK = 0x0E, ///< Mask for the receptions bit
	BK_STATUS_RX_EMPTY = 0x0E,
	BK_STATUS_RX_P_5 = 0x0A, ///< Data pipe 5 has some data ready
	BK_STATUS_RX_P_4 = 0x08, ///< Data pipe 4 has some data ready
	BK_STATUS_RX_P_3 = 0x06, ///< Data pipe 3 has some data ready
	BK_STATUS_RX_P_2 = 0x04, ///< Data pipe 2 has some data ready
	BK_STATUS_RX_P_1 = 0x02, ///< Data pipe 1 has some data ready
	BK_STATUS_RX_P_0 = 0x00, ///< Data pipe 0 has some data ready
	BK_STATUS_TX_FULL = 0x01 ///< Tx buffer full
};

/** Meanings of the FIFO_STATUS register */
enum BK_FIFO_STATUS_e {
	BK_FIFO_STATUS_TX_REUSE = 0x40, ///<
	BK_FIFO_STATUS_TX_FULL  = 0x20, ///< The tx buffer has more than ? item
	BK_FIFO_STATUS_TX_EMPTY = 0x10, ///< The tx buffer has less than ? item
	BK_FIFO_STATUS_RX_FULL  = 0x02, ///< The rx buffer has more than ? items
	BK_FIFO_STATUS_RX_EMPTY = 0x01  ///< The rx buffer has less than ? items
};

