SkyRocketToys/STM8TX/lib/beken.c
/* Statistics about the radio */
typedef struct RadioStats_s {
	uint32_t numTxPackets; ///< Number of packets we have told the Beken chip to send
	uint32_t numRxPackets; ///< Number of packets the Beken chip says it has received
	uint32_t numTelemPackets; ///< Number of telemetry packets received
	uint32_t numSentPackets; ///< Number of packets that the Beken chip acknowledges sending
	uint32_t recvTimestampMs;
	uint32_t lastTelemetryPktTime;
	uint16_t lastTxPacketCount;
	uint8_t lastRxLen;
	uint8_t badRxAddress;
} RadioStats;

/** Parameters used by the fcc pretests */
typedef struct FccParams_s {
    bool test_mode; ///< true iff we are sending test signals
    bool scan_mode; ///< true for scanning, false for fixed frequencies
	bool CW_mode; ///< true for carrier wave, false for packets
    uint8_t scan_count; ///< In scan mode, packet count before incrementing scan
    uint8_t channel; ///< Current frequency 8..70
    uint8_t power; ///< Current power 0..7
	uint8_t factory_mode; ///< factory test mode 0..8
} FccParams;

/** Internal variables for the radio */
typedef struct RadioInfo_s {
	RadioStats stats;
	RadioStats last_stats;
	FccParams fcc;
    uint8_t telem_pps; ///< Packets Per Second of telemetry received
    uint8_t send_pps; ///< Packets Per Second our beken chip admits to have sent
	// Radio parameters
	uint16_t bind_packets; ///< Number of manual binding packets remaining to send
	uint8_t lastTxChannel; ///< 0..CHANNEL_COUNT_LOGICAL * CHANNEL_NUM_TABLES * CHANNEL_DWELL_PACKETS (+0x80)
	uint8_t lastTxPower; ///< 0..7
	bool lastTxCwMode; ///< 0=packet, 1=carrier wave
	uint8_t TX0_Address[5]; ///< Base address of ctrl tx
	uint8_t TX1_Address[5]; ///< Base address of binding tx
	uint8_t RX0_Address[5]; ///< Base address of telemetry/dfu rx
	uint8_t RX1_Address[5]; ///< (Dummy) Base address of telemetry/dfu rx
	// Data to send to the drone
	packetFormatTx pktDataTx; ///< Packet data to send
	// Data received from the drone. See also t_status
	uint8_t pktDataRecv[PACKET_LENGTH_RX_MAX]; // Packet data in process of being received
	uint8_t pktDataRx[PACKET_LENGTH_RX_MAX]; // Last valid packet that has been received
	uint8_t lastDroneid[SZ_CRC_GUID]; // CRC of the drone
	// Adaptive frequency hopping
	uint8_t channel_idx_min; // Bounds for lastTxChannel
	uint8_t channel_idx_max; // Bounds for lastTxChannel
	uint8_t wifi_current;
	uint8_t wifi_wanted;
	uint8_t wifi_wanted_countdown; // For counting down to changing wifi table
	uint8_t hopping_current; // What we are using for sending
	uint8_t hopping_wanted; // What the drone wants us to use
	uint8_t hopping_wanted_countdown; // For counting down to changing adaptive table
} RadioInfo;

RadioInfo beken;
struct telem_status t_status;

// ----------------------------------------------------------------------------
uint8_t beken_get_tx_channel(void) { return beken.lastTxChannel; }

// ----------------------------------------------------------------------------
/** Kick the independant windowed watchdog so that it does not reset the CPU by timing out */
void IWDG_Kick(void)
{
#if SUPPORT_WATCHDOG
	IWDG->KR = IWDG_KEY_REFRESH; // Kick the watchdog so we don't reset
#endif
}


// -----------------------------------------------------------------------------
/** Write a single byte command to the SPI bus (e.g. Flush) */
void SPI_Write_Cmd(
	uint8_t reg) ///< The simple command to write #BK_SPI_CMD_e
{
	spi_force_chip_select(true); // CSN low, init SPI transaction
	spi_write(1, &reg);
	spi_force_chip_select(false); // CSN high again
}

// ----------------------------------------------------------------------------
/** Writes value 'value' to register 'reg' */
void SPI_Write_Reg(
	uint8_t reg,  ///< The command to write #BK_SPI_CMD_e
	uint8_t value) ///< The data value to write
{
	uint8_t tx[2];
	tx[0] = reg; // For actual registers, the caller must add BK_WRITE_REG flag to reg.
	tx[1] = value;
	spi_force_chip_select(true); // CSN low, init SPI transaction
	spi_write(2, &tx[0]);
	spi_force_chip_select(false); // CSN high again
}

// ----------------------------------------------------------------------------
/** Read the status from the BK2425 */
uint8_t SPI_Read_Status(void)
{
	uint8_t tx = BK_NOP;
	uint8_t rx = 0;
	spi_force_chip_select(true); // CSN low, init SPI transaction
    spi_transfer(1, &tx, &rx);
	spi_force_chip_select(false); // CSN high again
	return rx; // return register value
}

// ----------------------------------------------------------------------------
/** Read one uint8_t from BK2425 register 'reg' via SPI
\return The register value */
uint8_t SPI_Read_Reg(
	uint8_t reg)  ///< The command to write #BK_SPI_CMD_e
{
	uint8_t tx[2];
	uint8_t rx[2];
	tx[0] = reg;
	tx[1] = 0;
	spi_force_chip_select(true); // CSN low, init SPI transaction
	spi_transfer(2, &tx[0], &rx[0]); // Select register to read from..
	spi_force_chip_select(false); // CSN high again
	return rx[1]; // return register value
}

// ----------------------------------------------------------------------------
/** Writes contents of a buffer to BK2425 via SPI */
void SPI_Write_Buf(
	uint8_t reg,   ///< The command to write #BK_SPI_CMD_e
	const uint8_t *pBuf,  ///< The data to write
	uint8_t length) ///< The length in bytes of the data to write
{
	spi_force_chip_select(true);
	spi_write(1, &reg);
	spi_write(length, pBuf);
	spi_force_chip_select(false);
}

// ----------------------------------------------------------------------------
// Frequency hopping
// ----------------------------------------------------------------------------


const uint8_t channelTable[256] = {
#if 0 // Support single frequency mode (no channel hopping)
	// Normal frequencies
	23,23,23,23,23,23,23,23,23,23,23,23,23,23,23,23, // Normal
	23,23,23,23,23,23,23,23,23,23,23,23,23,23,23,23, // Wifi channel 1,2,3,4,5
	23,23,23,23,23,23,23,23,23,23,23,23,23,23,23,23, // Wifi channel 6
	23,23,23,23,23,23,23,23,23,23,23,23,23,23,23,23, // Wifi channel 7
	23,23,23,23,23,23,23,23,23,23,23,23,23,23,23,23, // Wifi channel 8
	23,23,23,23,23,23,23,23,23,23,23,23,23,23,23,23, // Wifi channel 9,10,11
	23,23,23,23,23,23,23,23,23,23,23,23,23,23,23,23, // Test mode channels
	23,23,23,23,23,23,23,23,23,23,23,23,23,23,23,23, // Reserved
	// Alternative frequencies
	23,23,23,23,23,23,23,23,23,23,23,23,23,23,23,23, // Normal
	23,23,23,23,23,23,23,23,23,23,23,23,23,23,23,23, // Wifi channel 1,2,3,4,5
	23,23,23,23,23,23,23,23,23,23,23,23,23,23,23,23, // Wifi channel 6
	23,23,23,23,23,23,23,23,23,23,23,23,23,23,23,23, // Wifi channel 7
	23,23,23,23,23,23,23,23,23,23,23,23,23,23,23,23, // Wifi channel 8
	23,23,23,23,23,23,23,23,23,23,23,23,23,23,23,23, // Wifi channel 9,10,11
	23,23,23,23,23,23,23,23,23,23,23,23,23,23,23,23, // Test mode channels
	23,23,23,23,23,23,23,23,23,23,23,23,23,23,23,23, // Reserved
#else // Frequency hopping
	// Normal frequencies
	47,21,31,52,36,13,72,41, 69,56,16,26,61,10,45,66, // Normal
	57,62,67,72,58,63,68,59, 64,69,60,65,70,61,66,71, // Wifi channel 1,2,3,4,5 (2457..2472MHz)
	62,10,67,72,63,68,11,64, 69,60,65,70,12,61,66,71, // Wifi channel 6
	10,67,11,72,12,68,13,69, 14,65,15,70,16,66,17,71, // Wifi channel 7
	10,70,15,20,14,71,16,21, 12,17,22,72,13,18,11,19, // Wifi channel 8
	10,15,20,25,11,16,21,12, 17,22,13,18,23,14,19,24, // Wifi channel 9,10,11
	46,41,31,52,36,13,72,69, 21,56,16,26,61,66,10,43, // Test mode channels
	46,41,31,52,36,13,72,69, 21,56,16,26,61,66,10,43, // Reserved
	// Alternative frequencies
	17,11,63,19,67,44,43,38, 50,54,70,58,29,35,25,14, // Normal
	18,10,23,21,33,44,41,38, 52,45,47,25,30,35,49,14, // Wifi channel 1,2,3,4,5
	18,56,23,21,33,44,41,38, 52,45,47,25,30,35,49,14, // Wifi channel 6
	18,56,23,21,33,44,41,38, 52,45,47,25,30,35,49,61, // Wifi channel 7
	68,56,24,53,33,44,41,38, 28,45,47,65,30,35,49,61, // Wifi channel 8
	68,56,72,53,33,44,41,38, 28,45,47,65,30,35,49,61, // Wifi channel 9,10,11
	46,41,31,52,36,13,72,69, 21,56,16,26,61,66,10,43, // Test mode channels (as normal)
	46,41,31,52,36,13,72,69, 21,56,16,26,61,66,10,43, // Reserved (as normal)
#endif
};

// ----------------------------------------------------------------------------
/** Set the range of the channel indexes we are using
\return true if we changed something */
bool SetChannelRange(
	uint8_t min, ///< The minimum logical channel range
	uint8_t max) ///< One past the maximum logical channel range
{
	min *= CHANNEL_DWELL_PACKETS;
	max *= CHANNEL_DWELL_PACKETS;
	if ((beken.channel_idx_min != min) || (beken.channel_idx_max != max))
	{
		beken.channel_idx_min = min;
		beken.channel_idx_max = max;
		return true;
	}
	return false;
}

// ----------------------------------------------------------------------------
/** Convert a logical channel index into a physical channel
\return The physical channel, in MHz above 2400Mhz. */
uint8_t LookupChannel(
	uint8_t idx) ///< The logical channel, as an index into a frequency hopping table.
{
	return channelTable[idx / CHANNEL_DWELL_PACKETS];
}

// ----------------------------------------------------------------------------
// Which bits correspond to each channel within a table, for adaptive frequencies
const uint8_t channel_bit_table[16] = {
	0x01, 0, 0x02, 0, 0x04, 0, 0x08, 0,
	0x10, 0, 0x20, 0, 0x40, 0, 0x80, 0
};

// ----------------------------------------------------------------------------
/** Channel hopping algorithm implementation.
	Calculate the next channel to use for transmission and change to it
	\return The next value of the logical channel index. */
uint8_t NextChannelIndex(
	uint8_t seq) ///< The current value of the logical channel index
{
	if (beken.wifi_wanted_countdown)
	{
		if (--beken.wifi_wanted_countdown == 0)
		{
			SetChannelRange(beken.wifi_wanted, beken.wifi_wanted + CHANNEL_COUNT_LOGICAL);
			seq = beken.wifi_wanted;
			printf("Table %d\r\n", beken.wifi_wanted);
			return seq;
		}
	}
	else if (beken.hopping_wanted_countdown)
	{
		if (--beken.hopping_wanted_countdown == 0)
		{
			beken.hopping_current = beken.hopping_wanted;
			printf("[A%d] ", beken.hopping_current);
		}
	}
	seq = (seq + 1) & ~0x80; // Get rid of the alternative bit
	if ((seq >= beken.channel_idx_max) || (seq < beken.channel_idx_min))
		seq = beken.channel_idx_min;
	// Support adaptive frequency hopping
	if (beken.hopping_current & channel_bit_table[seq & 15])
		seq |= 0x80;
	return seq;
}

// ----------------------------------------------------------------------------
// Beken higher level functions
// ----------------------------------------------------------------------------


// ----------------------------------------------------------------------------
/** Switch the Beken radio to Rx mode */
void BK2425_SwitchToRxMode(void)
{
	uint8_t value;

	SPI_Write_Cmd(BK_FLUSH_RX); // flush Rx
 	value = SPI_Read_Status(); // read register STATUS's value
	SPI_Write_Reg(BK_WRITE_REG | BK_STATUS, value); // clear RX_DR or TX_DS or MAX_RT interrupt flag

	BEKEN_CE_LOW();
	for (value = 0; value < 40; ++value)
		nop();
	value = SPI_Read_Reg(BK_CONFIG);	// read register CONFIG's value
	value |= BK_CONFIG_PRIM_RX; // set bit 0
	value |= BK_CONFIG_PWR_UP;
	SPI_Write_Reg(BK_WRITE_REG | BK_CONFIG, value); // Set PWR_UP bit, enable CRC(2 length) & Prim:RX. RX_DR enabled..

	BEKEN_CE_HIGH();
	BEKEN_PA_LOW();
}

// ----------------------------------------------------------------------------
/** Switch the Beken radio to Tx mode */
void BK2425_SwitchToTxMode(void)
{
	uint8_t value;
	SPI_Write_Cmd(BK_FLUSH_TX); // flush Tx

	BEKEN_PA_HIGH();
	BEKEN_CE_LOW();
	for (value = 0; value < 40; ++value)
		nop();
	value = SPI_Read_Reg(BK_CONFIG); // read register CONFIG's value
	value &= ~BK_CONFIG_PRIM_RX; // Clear bit 0 (PTX)
	value |= BK_CONFIG_PWR_UP;

