SkyRocketToys/STM8TX/lib/beken.c
	SPI_Write_Reg(BK_WRITE_REG | BK_CONFIG, value); // Set PWR_UP bit, enable CRC(2 length) & Prim:RX. RX_DR enabled.
	BEKEN_CE_HIGH();
}

// ----------------------------------------------------------------------------
/** Switch the Beken radio to Idle mode */
void BK2425_SwitchToIdleMode(void)
{
	uint8_t value;
	SPI_Write_Cmd(BK_FLUSH_TX); // flush Tx

	BEKEN_PA_LOW();
	BEKEN_CE_LOW();
	for (value = 0; value < 40; ++value)
		nop();
}

// ----------------------------------------------------------------------------
/** Switch the Beken radio to Sleep mode */
#if FATCODE
void BK2425_SwitchToSleepMode(void)
{
	uint8_t value;

	SPI_Write_Cmd(BK_FLUSH_RX); // flush Rx
 	SPI_Write_Cmd(BK_FLUSH_TX); // flush Tx
 	value = SPI_Read_Status(); // read register STATUS's value
	SPI_Write_Reg(BK_WRITE_REG | BK_STATUS, value); // clear RX_DR or TX_DS or MAX_RT interrupt flag

	BEKEN_PA_LOW();
	BEKEN_CE_LOW();
	for (value = 0; value < 40; ++value)
		nop();
	value = SPI_Read_Reg(BK_CONFIG);	// read register CONFIG's value
	value |= BK_CONFIG_PRIM_RX; // Receive mode
	value &= ~BK_CONFIG_PWR_UP; // Power down
	SPI_Write_Reg(BK_WRITE_REG | BK_CONFIG, value); // Clear PWR_UP bit, enable CRC(2 length) & Prim:RX. RX_DR enabled..
	// Stay low
	BEKEN_CE_LOW();
}
#endif

// ----------------------------------------------------------------------------
/** Set which register bank we are accessing on the Beken spi chip */
void BK2425_SetRBank(
	char _cfg) ///< 1=Bank1 0=Bank0
{
	uint8_t bank = SPI_Read_Status() & BK_STATUS_RBANK;
	if (!bank != !_cfg)
	{
		SPI_Write_Reg(BK_ACTIVATE_CMD, 0x53); // Note: Must NOT have BK_WRITE_REF added to it
	}
}

#if (TX_SPEED==250)
ITX_SPEED gTxSpeed = ITX_250;
#elif (TX_SPEED==100)
ITX_SPEED gTxSpeed = ITX_1000;
#elif (TX_SPEED==2000)
ITX_SPEED gTxSpeed = ITX_2000;
#endif

// ----------------------------------------------------------------------------
/** Return the current speed in kbps */
int BK2425_GetSpeed(void)
{
	switch (gTxSpeed) {
	case ITX_250: return 250;
	case ITX_1000: return 1000;
	case ITX_2000: return 2000;
	default: return 0;
	};
}

// ----------------------------------------------------------------------------
/** BK2425 initialization of radio registers */
void BK2425_Initialize(
	ITX_SPEED spd) ///< The baudrate to modulate the transmission and reception at.
{
	int8_t i;
	bkReady = 0;
	gTxSpeed = spd;
	delay_ms(100);//delay more than 50ms.
	BK2425_SetRBank(0);

	//********************Write Bank0 register******************
	for (i=20; i >= 0; i--) // From BK_FIFO_STATUS back to beginning of table
	{
		uint8_t idx = Bank0_Reg[i][0];
		uint8_t value = Bank0_Reg[i][1];
		if (idx == BK_RF_SETUP) // Adjust for speed
			value = Bank0_Reg6[spd][1];
		SPI_Write_Reg((BK_WRITE_REG | idx), value);
	}

	// Set the various 5 byte addresses
	SPI_Write_Buf((BK_WRITE_REG | BK_RX_ADDR_P0), beken.RX0_Address, 5); // reg 10 - Rx0 addr
	SPI_Write_Buf((BK_WRITE_REG | BK_RX_ADDR_P1), beken.RX1_Address, 5); // REG 11 - Rx1 addr
	SPI_Write_Buf((BK_WRITE_REG | BK_TX_ADDR), beken.TX1_Address, 5); // REG 16 - TX addr

	// Enable the feature register and set it
	i = SPI_Read_Reg(BK_FEATURE);
	if (i == 0) // i!=0 shows that chip has already been activated. So do not toggle activation.
		SPI_Write_Reg(BK_ACTIVATE_CMD, 0x73); // Note: Must NOT have BK_WRITE_REF added to it
	// Now that BK_FEATURE and BK_DYNPD are activated, use them
	for (i = 22; i >= 21; i--)
		SPI_Write_Reg((BK_WRITE_REG | Bank0_Reg[i][0]), Bank0_Reg[i][1]);

	//********************Write Bank1 register******************
	BK2425_SetRBank(1);
	for (i = IREG1_4; i <= IREG1_13; i++)
	{
		const uint8_t* p = &Bank1_RegTable[spd][i][0];
		uint8_t idx = *p++;
		SPI_Write_Buf((BK_WRITE_REG|idx), p, 4);
	}
	SPI_Write_Buf((BK_WRITE_REG|BK2425_R1_14),&(Bank1_Reg14[0]),11);

//toggle REG4<25,26>
	{
		const uint8_t* p = &Bank1_RegTable[spd][IREG1_4A][0];
		uint8_t idx = *p++;
		SPI_Write_Buf((BK_WRITE_REG|idx), p, 4);
	}
	{
		const uint8_t* p = &Bank1_RegTable[spd][IREG1_4][0];
		uint8_t idx = *p++;
		SPI_Write_Buf((BK_WRITE_REG|idx), p, 4);
	}

	delay_ms(100);//delay more than 50ms.

	/********************switch back to Bank0 register access******************/
	BK2425_SetRBank(0);
	BK2425_SwitchToRxMode(); // switch to RX mode
	bkReady = 1;
}

// ----------------------------------------------------------------------------
#if FATCODE
bool bRadioFast = false;
/** Change between 250kbps and 2000kbps on the fly */
void BK2425_SetSpeed(
	bool bFast) ///< false=slow speed, true=fast speed
{
	ITX_SPEED spd = ITX_250;
	if (bFast == bRadioFast)
		return;
	if (bFast)
		spd = ITX_2000;
	gpio_config(RADIO_INT, GPIO_INPUT_PULLUP);
	BK2425_SwitchToSleepMode();
	BK2425_Initialize(spd);
	gpio_config(RADIO_INT, GPIO_INPUT_PULLUP_IRQ);
	bRadioFast = bFast;
}
#endif

// ----------------------------------------------------------------------------
/** Write a 32-bit Bank1 register */
void SPI_Bank1_Write_Reg(
	uint8_t reg, ///< A spi register in bank1 to write to #BK_SPI_CMD_e
	const uint8_t *pBuf) ///< A pointer to a 32-bit buffer to be written
{
	BK2425_SetRBank(1);
	SPI_Write_Buf(reg, pBuf, 4);
	BK2425_SetRBank(0);
}

// ----------------------------------------------------------------------------
/** Read a 32-bit Bank1 register */
void SPI_Bank1_Read_Reg(
	uint8_t reg, ///< A spi register in bank1 to write to #BK_SPI_CMD_e
	uint8_t *pBuf) ///< A pointer to a 32-bit buffer to be read into
{
	BK2425_SetRBank(1);
	spi_read_registers(reg, pBuf, 4);
	BK2425_SetRBank(0);
}

// ----------------------------------------------------------------------------
/** Change the radio channel */
void BK2425_ChangeChannel(
	uint8_t channelNumber) ///< A physical radio channel. See #CHANNEL_MHZ_e
{
	if (channelNumber > CHANNEL_MAX_PHYSICAL)
		return;
	SPI_Write_Reg((BK_WRITE_REG | BK_RF_CH), channelNumber);
}

// ----------------------------------------------------------------------------
/* Clear the radio acknowledge overflow status of the Beken chip.
	\return true if BK_STATUS_MAX_RT was found in the set state, false otherwise */
bool BK2425_ClearAckOverflow(void)
{
	uint8_t status = SPI_Read_Status();
	if ((BK_STATUS_MAX_RT & status) == 0)
	{
    	return false;
	}
	else
	{
		SPI_Write_Reg((BK_WRITE_REG | BK_STATUS), BK_STATUS_MAX_RT);
    	return true;
	}
}

// ----------------------------------------------------------------------------
// Set up the addresses
void beken_set_address(void)
{
	const uint8_t* uuid = (const uint8_t*) U_ID00;
	uint32_t address = crc_crc32(uuid, 12); // Unique chip ID (x:16, y:16, wafer:8, lot:56)

	beken.TX0_Address[0] = 0x31;
	beken.TX0_Address[1] = (address >> 16) & 0xff;
	beken.TX0_Address[2] = 0x59;
	beken.TX0_Address[3] = (address >> 8) & 0xff;
	beken.TX0_Address[4] = (address) & 0xff;

	beken.TX1_Address[0] = 0x32;
	beken.TX1_Address[1] = 0x99;
	beken.TX1_Address[2] = 0x59;
	beken.TX1_Address[3] = 0xC6;
	beken.TX1_Address[4] = 0x2D;

	beken.RX1_Address[0] = beken.RX0_Address[0] = 0x33;
	beken.RX1_Address[1] = beken.RX0_Address[1] = (address >> 16) & 0xff;
	beken.RX1_Address[2] = beken.RX0_Address[2] = 0x59;
	beken.RX1_Address[3] = beken.RX0_Address[3] = (address >> 8) & 0xff;
	beken.RX1_Address[4] = beken.RX0_Address[4] = (address) & 0xff;
}

// ----------------------------------------------------------------------------
// Override the addresses, for the factory test mode
void beken_set_factory_address(void)
{
	beken.TX0_Address[0] = beken.TX1_Address[0] = 0x34;
	beken.TX0_Address[1] = beken.TX1_Address[1] = 0x99;
	beken.TX0_Address[2] = beken.TX1_Address[2] = 0x59;
	beken.TX0_Address[3] = beken.TX1_Address[3] = 0xC6;
	beken.TX0_Address[4] = beken.TX1_Address[4] = beken.fcc.factory_mode;

	beken.RX1_Address[0] = beken.RX0_Address[0] = 0x35;
	beken.RX1_Address[1] = beken.RX0_Address[1] = 0x99;
	beken.RX1_Address[2] = beken.RX0_Address[2] = 0x59;
	beken.RX1_Address[3] = beken.RX0_Address[3] = 0xC6;
	beken.RX1_Address[4] = beken.RX0_Address[4] = beken.fcc.factory_mode;

	// Set the various 5 byte addresses
	BK2425_SwitchToIdleMode();
	SPI_Write_Buf((BK_WRITE_REG | BK_RX_ADDR_P0), beken.RX0_Address, 5); // reg 10 - Rx0 addr
	SPI_Write_Buf((BK_WRITE_REG | BK_RX_ADDR_P1), beken.RX1_Address, 5); // REG 11 - Rx1 addr
	SPI_Write_Buf((BK_WRITE_REG | BK_TX_ADDR), beken.TX1_Address, 5); // REG 16 - TX addr
}

// ----------------------------------------------------------------------------
/** Initialise the Beken chip ready to be talked to */
void initBeken(void)
{
	beken_set_address();

	/* Set ChipSelect pin in Output push-pull high level in spi_init() */
    gpio_config(RADIO_TXEN, GPIO_OUTPUT_PUSHPULL);
    gpio_config(RADIO_CE, GPIO_OUTPUT_PUSHPULL);

	BEKEN_DESELECT();
	BEKEN_CE_LOW();
}

// ----------------------------------------------------------------------------
/** DeInitialise the Beken chip after talking */
void deinitBeken(void)
{
}

// ----------------------------------------------------------------------------
/** Describe our transmission parameters to the serial port for verification by the tester */
void describeBeken(void)
{
#if SUPPORT_UART
	uint8_t i;
	printf("# TxSpeed %dkbps\r\n", (int) BK2425_GetSpeed() );
	printf("# Channels[%d][%d]=", (int) CHANNEL_NUM_TABLES, (int) CHANNEL_COUNT_LOGICAL );
	for (i = 0; i < CHANNEL_COUNT_LOGICAL; ++i)
	{
		printf("%d ", (int) LookupChannel(i));
	}
	printf("\r\n##########\r\n");
#endif
}

// ----------------------------------------------------------------------------
/** Change address */
void ChangeAddressTx(
	uint8_t txch) ///< 0 for data, 1 for binding
{
	if (txch)
	{
		SPI_Write_Buf((BK_WRITE_REG|BK_TX_ADDR), beken.TX1_Address, 5); // REG 16 - TX addr
	}
	else
	{
		SPI_Write_Buf((BK_WRITE_REG|BK_TX_ADDR), beken.TX0_Address, 5); // REG 16 - TX addr
	}
}

#define OUTPUT_POWER_REG6_0 0 // -25dB
#define OUTPUT_POWER_REG6_1 0 // -18dB
#define OUTPUT_POWER_REG6_2 1 // -18dB
#define OUTPUT_POWER_REG6_3 1 // -12dB
#define OUTPUT_POWER_REG6_4 1 // -12dB
#define OUTPUT_POWER_REG6_5 2 //  -7dB
#define OUTPUT_POWER_REG6_6 3 //  -1dB
#define OUTPUT_POWER_REG6_7 3 //  +4dB

// Register 4 in bank 1 only applies to Beken chip
#define OUTPUT_POWER_REG4_0 0 // -25dB
#define OUTPUT_POWER_REG4_1 3 // -18dB
#define OUTPUT_POWER_REG4_2 0 // -18dB
#define OUTPUT_POWER_REG4_3 3 // -12dB
#define OUTPUT_POWER_REG4_4 2 // -12dB
#define OUTPUT_POWER_REG4_5 0 //  -7dB
#define OUTPUT_POWER_REG4_6 0 //  -1dB
#define OUTPUT_POWER_REG4_7 7 //  +4dB

// ----------------------------------------------------------------------------
const uint8_t RegPower[8][2] = {
	{ OUTPUT_POWER_REG4_0, OUTPUT_POWER_REG6_0 },
	{ OUTPUT_POWER_REG4_1, OUTPUT_POWER_REG6_1 },
	{ OUTPUT_POWER_REG4_2, OUTPUT_POWER_REG6_2 },
	{ OUTPUT_POWER_REG4_3, OUTPUT_POWER_REG6_3 },
	{ OUTPUT_POWER_REG4_4, OUTPUT_POWER_REG6_4 },
	{ OUTPUT_POWER_REG4_5, OUTPUT_POWER_REG6_5 },
	{ OUTPUT_POWER_REG4_6, OUTPUT_POWER_REG6_6 },
	{ OUTPUT_POWER_REG4_7, OUTPUT_POWER_REG6_7 },
};

// ----------------------------------------------------------------------------
/** Change the radio output power of the Beken radio chip */
/** Must be done on main thread since it is slow */
void BK2425_SetTxPower(
	uint8_t power) ///< power value
{
	uint8_t oldready = bkReady;
	if (power > 7)
		return;

	bkReady = 0;
	IWDG_Kick();
	delay_ms(100); // delay more than 50ms.
	BK2425_SetRBank(1);
	{
		const uint8_t* p = &Bank1_RegTable[beken.lastTxCwMode ? ITX_CARRIER : gTxSpeed][IREG1_4][0];
		uint8_t idx = *p++;
		uint8_t buf[4];
		buf[0] = *p++;
		buf[1] = *p++;
		buf[2] = *p++;
		buf[3] = *p++;
		buf[0] &= ~0x38;
		buf[0] |= (RegPower[power][0] << 3); // Bits 27..29
		SPI_Write_Buf((BK_WRITE_REG|idx), buf, 4);
	}
	IWDG_Kick();
	delay_ms(100); // delay more than 50ms.
	IWDG_Kick();
	BK2425_SetRBank(0);
	delay_ms(100);
	IWDG_Kick();

	{
		uint8_t setup = SPI_Read_Reg(BK_RF_SETUP);
		setup &= ~(3 << 1);
		setup |= (RegPower[power][1] << 1); // Bits 1..2
		if (beken.lastTxCwMode)
			setup |= 0x10;
		SPI_Write_Reg((BK_WRITE_REG | BK_RF_SETUP), setup);
	}
	beken.lastTxPower = power;
	bkReady = oldready;
}

// ----------------------------------------------------------------------------
/** Enable/disable the carrier sending mode */
/** Must be done on main thread since it is slow */
void BK2425_SetCarrierMode(
	uint8_t cw) ///< carrier mode
{
	uint8_t oldready = bkReady;
	bkReady = 0;
	IWDG_Kick();
	delay_ms(100); // delay more than 50ms.
	BK2425_SetRBank(1);
	{
		const uint8_t* p = &Bank1_RegTable[cw ? ITX_CARRIER : gTxSpeed][IREG1_4][0];
		uint8_t idx = *p++;
		uint8_t buf[4];
		buf[0] = *p++;
		buf[1] = *p++;
		buf[2] = *p++;
		buf[3] = *p++;
		buf[0] &= ~0x38;
		buf[0] |= (RegPower[beken.lastTxPower][0] << 3); // Bits 27..29
		SPI_Write_Buf((BK_WRITE_REG|idx), buf, 4);
	}
	IWDG_Kick();
	delay_ms(100); // delay more than 50ms.
	IWDG_Kick();
	BK2425_SetRBank(0);
	delay_ms(100);
	IWDG_Kick();

	{
		uint8_t setup = SPI_Read_Reg(BK_RF_SETUP);
		setup &= ~(3 << 1);
		setup |= (RegPower[beken.lastTxPower][1] << 1); // Bits 1..2
		if (cw)
			setup |= 0x10;
		SPI_Write_Reg((BK_WRITE_REG | BK_RF_SETUP), setup);
	}
	beken.lastTxCwMode = cw;
	bkReady = oldready;
}

// ----------------------------------------------------------------------------
/** Fill the Bekens tx FIFO to send a packet
	\return True if ack overflow was set when send was requested. */
bool Send_Packet(
	uint8_t type, ///< WR_TX_PLOAD or W_TX_PAYLOAD_NOACK_CMD
	const uint8_t* pbuf, ///< a buffer pointer
	uint8_t len) ///< packet length in bytes
{
	// read register FIFO_STATUS's value
	uint8_t fifo_sta = SPI_Read_Reg(BK_FIFO_STATUS);	// read register FIFO_STATUS's value
	bool returnValue = BK2425_ClearAckOverflow();

	if (!(fifo_sta & BK_FIFO_STATUS_TX_FULL)) // if not full, send data
	{
		beken.stats.numTxPackets++;
	#if SUPPORT_DEBUG_TX
		SET_DEBUG1();
		CLEAR_DEBUG1();
		SET_DEBUG1();
	#endif
		SPI_Write_Buf(type, pbuf, len); // Writes data to buffer A0,B0,A8
	#if SUPPORT_DEBUG_TX
		CLEAR_DEBUG1();
		SET_DEBUG1();
		CLEAR_DEBUG1();
		SET_DEBUG1();
	#endif
	}
	delta_send_packets = timer_read_delta_us(); // Check jitter near END of interrupt
	return returnValue;
}

// ----------------------------------------------------------------------------
/** Read FIFO to read a packet
	\returns 0 if no packet, 1 if packet read */
uint8_t Receive_Packet(
	uint8_t rx_buf[]) ///< The buffer to fill
{
	uint8_t len, sta, fifo_sta, returnVal;
	returnVal = 0;
	sta = SPI_Read_Reg(BK_STATUS); // read register STATUS's value
	if (sta & BK_STATUS_RX_DR) // if receive data ready (RX_DR) interrupt
	{
		do
		{
			beken.stats.numRxPackets++;
			len = SPI_Read_Reg(BK_R_RX_PL_WID_CMD);	// read received packet length in bytes
			beken.stats.lastRxLen = len;

			if (len <= PACKET_LENGTH_RX_MAX)
			{
				// This includes short packets (e.g. where no telemetry was sent)
				spi_read_registers(BK_RD_RX_PLOAD, rx_buf, len); // read receive payload from RX_FIFO buffer
				returnVal = 1;
			}
			else // Packet was too long
			{
				SPI_Write_Cmd(BK_FLUSH_RX); // flush Rx
			}
			fifo_sta = SPI_Read_Reg(BK_FIFO_STATUS);	// read register FIFO_STATUS's value
		} while (!(fifo_sta & BK_FIFO_STATUS_RX_EMPTY)); // while not empty
	}
	SPI_Write_Reg(BK_WRITE_REG | BK_STATUS,
		(BK_STATUS_RX_DR | BK_STATUS_TX_DS | BK_STATUS_MAX_RT)); // clear RX_DR or TX_DS or MAX_RT interrupt flag
	return returnVal;
}

// ----------------------------------------------------------------------------
/** Flush the Beken radio TX buffer */
void FlushTx(void)
{
	SPI_Write_Cmd(BK_FLUSH_TX); // flush Tx
}

// ----------------------------------------------------------------------------
/** Get the Beken radio chip ID
	\return BK_CHIP_ID_BK2425 */
uint8_t Get_Chip_ID(void)
{
	uint8_t ReadArr[4];
	SPI_Bank1_Read_Reg(BK2425_R1_WHOAMI, ReadArr);
	return ReadArr[0];
}

// ----------------------------------------------------------------------------
/** Ensure that the chip id is good */
void VerifyBekenChipID(void)
{
	uint8_t id = Get_Chip_ID();
#if SUPPORT_UART
	printf("\r\n# Chip ID: %u\r\n", id);
#endif
	while (id != BK_CHIP_ID_BK2425)
	{
#if SUPPORT_UART
		printf("Chip ID Failed: %u\r\n", id);
#endif
		IWDG_Kick();
		initBeken();
		delay_ms(200);
		id = Get_Chip_ID();
	}
}


// ----------------------------------------------------------------------------
// Interface expected by main program
// ----------------------------------------------------------------------------

// ----------------------------------------------------------------------------
/** Initialise the Beken radio chip */
void beken_init(void)
{
	uint32_t crc;

	beken.channel_idx_min = 0;
	beken.channel_idx_max = CHANNEL_COUNT_LOGICAL * 1 * CHANNEL_DWELL_PACKETS;

