SkyRocketToys/STM8TX/lib/beken.c
	// Initialise the firmware data
	crc = crc_crc32((const uint8_t *)CODELOC, (NEW_FIRMWARE_BASE-CODELOC));
	gFwInfo[BK_INFO_FW_CRC_LO] = crc & 0xffff;
	gFwInfo[BK_INFO_FW_CRC_HI] = (crc >> 16) & 0xffff;
	gFwInfo[BK_INFO_FW_VER] = 0;
	gFwInfo[BK_INFO_DFU_RX] = 0;
//	gFwInfo[BK_INFO_FW_YM] = (*((const uint8_t*)0xF986))+256u*(*((const uint8_t*)0xF987));
//	gFwInfo[BK_INFO_FW_DAY] = (*((const uint8_t*)0xF988))+256u*(*((const uint8_t*)0xF989));
	gFwInfo[BK_INFO_FW_YM] = (BUILD_DATE_YEAR-2017)*256u+BUILD_DATE_MONTH;
	gFwInfo[BK_INFO_FW_DAY] = (BUILD_DATE_DAY)*256u;
	gFwInfo[BK_INFO_MODEL] = 1;
	gFwInfo[BK_INFO_PPS] = 0; // Will be updated over time
	gFwInfo[BK_INFO_BATTERY] = 0; // Will be updated over time
	gFwInfo[BK_INFO_COUNTDOWN] = 0; // Will be updated over time

	// Setup the Beken chip. Assumes that SPI is initialised by now
	delay_ms(10);
	initBeken();
	IWDG_Kick();
	delay_ms(200);

	VerifyBekenChipID();
	IWDG_Kick();
	switch (BK2425_GetSpeed()) { // Use the default speed
	case 250: BK2425_Initialize(ITX_250); break;
	case 1000: BK2425_Initialize(ITX_1000); break;
	case 2000: BK2425_Initialize(ITX_2000); break;
	}
	// Should now be in Rx mode
	// Configure radio interrupt
	gpio_config(RADIO_INT, GPIO_INPUT_PULLUP_IRQ);
	BK2425_SwitchToRxMode();
}

typedef void (*simple_function)(void);
static const simple_function reboot = (simple_function) 0x8000;

// ----------------------------------------------------------------------------
void ProcessPacket(const uint8_t* pRxData, uint8_t rxstd)
{
	if (pRxData[0] == BK_PKT_TYPE_TELEMETRY)
	{
		const packetFormatRx* pRx = (const packetFormatRx*) pRxData;
		uint8_t tx;
		uint8_t wifi;
		beken.stats.lastTelemetryPktTime = timer_get_ms();
		beken.stats.numTelemPackets++;

		// If we have received enough telemetry, consider us bound
		if (beken.bind_packets > 1)
		{
			if (beken.stats.numTelemPackets > 10)
				beken.bind_packets = 1;
		}

		// Should we change channel table due to Wi-Fi changes?
		tx = 0;
		wifi = pRx->wifi;
		while (wifi >= 24*4)
		{
			wifi -= 24*4;
			tx += 4;
		}
		while (wifi >= 24) // Argh, avoid DIV instruction within an interrupt on STM8
		{
			wifi -= 24;
			++tx;
		}
		if ((wifi != beken.wifi_current) // Has the knowledge about the Wi-Fi channel changed?
			&& (!beken.fcc.factory_mode) // In factory mode, ignore wifi tables
			&& (!beken.fcc.test_mode)) // In fcc test mode, ignore wifi tables
		{
			uint8_t wanted = 0;
			beken.wifi_current = wifi;
			switch (pRx->wifi) {
			case 0: wanted = 0; break;
			case 1: case 2: case 3: case 4: case 5: wanted = 1; break;
			case 6: wanted = 2; break;
			case 7: wanted = 3; break;
			case 8: wanted = 4; break;
			default: wanted = 5; break;
			}
			beken.wifi_wanted_countdown = 10;
			beken.wifi_wanted = wanted * CHANNEL_COUNT_LOGICAL;
		}
		// Remember the data for later. Process that in the main thread
		t_status.flags = pRx->flags;
		{
			uint8_t i;
			for (i = 0; i < SZ_CRC_GUID; ++i)
				beken.lastDroneid[i] = pRx->droneid[i];
		}
		t_status.flight_mode = pRx->flight_mode;
		t_status.wifi_chan = wifi;
		t_status.tx_max = tx;
		t_status.note_adjust = pRx->note_adjust;
		if (pRx->hopping != beken.hopping_wanted)
		{
			beken.hopping_wanted = pRx->hopping;
			beken.hopping_wanted_countdown = 10;
			gFwInfo[BK_INFO_HOPPING] = pRx->hopping * 256; // At zero time, this is live
		}
	}
	else if (pRxData[0] == BK_PKT_TYPE_DFU)
	{
		static uint16_t lastAddr = 0xffff;
		const packetFormatDfu* pDFU = (const packetFormatDfu*) pRxData;
		uint16_t addr = (pDFU->address_hi << 8) | pDFU->address_lo;
//		printf("D%u\r\n", addr);
//		printf("D%u(%c%c%c%c%c%c%c%c", addr, pDFU->data[0], pDFU->data[1], pDFU->data[2], pDFU->data[3], pDFU->data[4], pDFU->data[5], pDFU->data[6], pDFU->data[7]);
//		printf("%c%c%c%c%c%c%c%c)", pDFU->data[8], pDFU->data[9], pDFU->data[10], pDFU->data[11], pDFU->data[12], pDFU->data[13], pDFU->data[14], pDFU->data[15]);
		memcpy(&dfu_buffer[addr & 0x70], &pDFU->data[0], SZ_DFU);
		if (addr != lastAddr)
		{
			if (addr == 2)
			{
				 if (lastAddr != 0xffff)
				 {
					// Reboot
					disableInterrupts();
				#if defined(__SDCC)
					{__asm__("ldw x,#0x7ff\n");}
					{__asm__("ldw sp,x\n");} // Should set stack to 0x7ff here
				#else
					asm("ldw x,#0x7ff\n");
					asm("ldw sp,x\n"); // Should set stack to 0x7ff here
				#endif
					(*reboot)();
				 }
			}
			printf("=");
			if ((addr & 0x7f) == 0x40) // Before the end of a page
			{
				// Perform a fast erase of the block
				if (!eeprom_flash_erase((addr & ~0x7f) + NEW_FIRMWARE_BASE))
				{
					dfu_written = 0xffff; // was write-protected
					printf("e");
				}
				else
					printf("E");
			}
			if ((addr & 0x7f) == 0x70) // End of a page
			{
				// Perform a fast write of the block
				if (!eeprom_flash_write_page((addr & ~0x7f) + NEW_FIRMWARE_BASE, dfu_buffer, false))
				{
					dfu_written = 0xffff; // was write-protected
					printf("w");
				}
				else
					printf("W");
			}
			lastAddr = addr;
			dfu_written = addr + SZ_DFU;
		}
	}
}

// ----------------------------------------------------------------------------
/** The IRQ routine that needs to be called on radio interrupts for the Beken chip */
void beken_irq(void)
{
	// Determine which state fired the interrupt
	uint8_t bk_sta = SPI_Read_Reg(BK_STATUS);
	if (bk_sta & BK_STATUS_TX_DS)
	{
	#if SUPPORT_DEBUG_TX
		CLEAR_DEBUG1();
		SET_DEBUG1();
		CLEAR_DEBUG1();
		SET_DEBUG1();
		CLEAR_DEBUG1();
		SET_DEBUG1();
		CLEAR_DEBUG1();
	#endif
		// Packet was sent successfully (not yet acknowledged)
		beken.stats.numSentPackets++;
		BK2425_SwitchToRxMode(); // Prepare to receive reply
	}
	if (bk_sta & BK_STATUS_MAX_RT)
	{
		// We have had a "max retries" error
	}
	if (bk_sta & BK_STATUS_RX_DR)
	{
		// We have received a packet
		uint8_t rxstd = 0;
		SET_DEBUG1();
		CLEAR_DEBUG1();
		// Which pipe (address) have we received this packet on?
		if ((bk_sta & BK_STATUS_RX_MASK) == BK_STATUS_RX_P_0)
		{
			rxstd = 0;
		}
		else
		{
			beken.stats.badRxAddress++;
		}
		SET_DEBUG1();
		CLEAR_DEBUG1();
		Receive_Packet(&beken.pktDataRecv[0]);
		SET_DEBUG1();
		CLEAR_DEBUG1();
		memcpy(&beken.pktDataRx[0], &beken.pktDataRecv[0], sizeof(beken.pktDataRx));
		ProcessPacket(&beken.pktDataRx[0], rxstd);
		SET_DEBUG1();
		CLEAR_DEBUG1();
		SET_DEBUG1();
		CLEAR_DEBUG1();
		SET_DEBUG1();
		CLEAR_DEBUG1();
		SET_DEBUG1();
		CLEAR_DEBUG1();
		SET_DEBUG1();
		CLEAR_DEBUG1();
	}

