SkyRocketToys/STM8TX/lib/beken.c
	// Clear the bits
	SPI_Write_Reg((BK_WRITE_REG | BK_STATUS), (BK_STATUS_MAX_RT | BK_STATUS_TX_DS | BK_STATUS_RX_DR));
}

// ----------------------------------------------------------------------------
static bool isDisconnected(void)
{
	if (beken.fcc.test_mode)
		return false;
	return (beken.stats.lastTelemetryPktTime == 0) || (timer_get_ms() > beken.stats.lastTelemetryPktTime + 1000);
}

// ----------------------------------------------------------------------------
// Update a radio control packet
// Called from IRQ context
void UpdateTxData(void)
{
	static uint8_t txInfo = 0;
	uint16_t val;
	packetFormatTx* tx = &beken.pktDataTx;

	// Base values for this packet type
	tx->packetType = isDisconnected() ? BK_PKT_TYPE_CTRL_LOST : BK_PKT_TYPE_CTRL_FOUND; ///< The packet type
//	tx->channel;
	tx->u.ctrl.msb = 0;
	tx->u.ctrl.buttons_held = get_buttons_held();
	tx->u.ctrl.buttons_toggled = get_buttons_toggled();
	tx->u.ctrl.data_type = 0;
	tx->u.ctrl.data_value_lo = 0;
	tx->u.ctrl.data_value_hi = 0;

	// Put in the stick values
	val = channel_value(0);
	tx->u.ctrl.roll = val & 0xff;
	tx->u.ctrl.msb |= (val & 0x300) >> 2;
	val = channel_value(1);
	tx->u.ctrl.pitch = val & 0xff;
	tx->u.ctrl.msb |= (val & 0x300) >> 4;
	val = channel_value(2);
	tx->u.ctrl.throttle = val & 0xff;
	tx->u.ctrl.msb |= (val & 0x300) >> 6;
	val = channel_value(3);
	tx->u.ctrl.yaw = val & 0xff;
	tx->u.ctrl.msb |= (val & 0x300) >> 8;

	// Put in the extra data fields
	if (beken.wifi_wanted_countdown)
	{
		val = beken.wifi_wanted_countdown + 256 * beken.wifi_wanted;
		tx->u.ctrl.data_type = BK_INFO_COUNTDOWN;
	}
	else if (beken.hopping_wanted_countdown)
	{
		val = beken.hopping_wanted_countdown + 256 * beken.hopping_wanted;
		tx->u.ctrl.data_type = BK_INFO_HOPPING;
	}
	else if (dfu_written)
	{
		val = dfu_written;
		tx->u.ctrl.data_type = BK_INFO_DFU_RX;
	}
	else
	{
		if (++txInfo >= BK_INFO_MAX)
			txInfo = BK_INFO_MIN;
		if (txInfo == BK_INFO_BATTERY)
		{
			// The voltage is defined as being in 0.025 volt units (40 to a volt)
			// According to the schematic, Vreg is 3.0 volts and the voltage divider is 0.5
			// meaning a reading of 1023 means about 6.0v
			// This has a value of 240, giving a ratio of 60/256
	        // But tridges measurements give the ratio of 23/156 which is 38/256
	        gFwInfo[BK_INFO_BATTERY] = (adc_value(4) * (uint16_t)38) / (uint16_t)256;
		}
		val = gFwInfo[txInfo];
		tx->u.ctrl.data_type = txInfo;
	}
	tx->u.ctrl.data_value_lo = val & 0xff;
	tx->u.ctrl.data_value_hi = (val >> 8) & 0xff;
}

// ----------------------------------------------------------------------------
void UpdateTxBindData(bool bAuto)
{
	packetFormatTx* tx = &beken.pktDataTx;
	uint8_t i;

	tx->packetType = bAuto ? BK_PKT_TYPE_BIND_AUTO : BK_PKT_TYPE_BIND_MANUAL;
//	tx->channel;
	for (i = 0; i < 5; ++i)
		tx->u.bind.bind_address[i] = beken.RX0_Address[i];
	tx->u.bind.hopping = beken.hopping_current;
	for (i = 0; i < SZ_CRC_GUID; ++i)
		tx->u.bind.droneid[0] = beken.lastDroneid[i];
}

// ----------------------------------------------------------------------------
// Prepare to send a FCC packet
static void UpdateFccScan(void)
{
	// Support scan mode
    if (beken.fcc.scan_mode) {
        beken.fcc.scan_count++;
        if (beken.fcc.scan_count >= 200) {
            beken.fcc.scan_count = 0;
            beken.fcc.channel += 2; // Go up by 2Mhz
            if (beken.fcc.channel >= CHANNEL_FCC_HIGH) {
                beken.fcc.channel = CHANNEL_FCC_LOW;
            }
        }
    }
}

// ----------------------------------------------------------------------------
/** From the main thread, we must check to see if (slow) parameter changes are needed */
bool CheckUpdateFccParams(void)
{
	bool result = false;
	if (beken.fcc.test_mode)
	{
		// Set the power
		if (beken.lastTxPower != beken.fcc.power) {
			BK2425_SetTxPower(beken.fcc.power);
			result = true;
		}

		// Set CW mode
		if (beken.fcc.CW_mode != beken.lastTxCwMode) {
			BK2425_SetCarrierMode(beken.fcc.CW_mode);
			result = true;
//			beken_DumpRegisters();
		}
	}
	else
	{
		if (t_status.tx_max && (t_status.tx_max-1 != beken.lastTxPower))
		{
			BK2425_SetTxPower(t_status.tx_max-1);
			result = true;
		}
	}
	return result;
}

// ----------------------------------------------------------------------------
/** The IRQ routine that needs to be called on timer interrupts for the Beken chip */
void beken_timer_irq(void)
{
	static uint8_t txChannel = 0;
	static uint8_t bindTimer = 0;
	// No need for this as caller takes care of it:
	// TIM4->SR1 = (uint8_t)(~TIM4_IT_UPDATE);
	if (!bkReady) // We are reinitialising the chip in the main thread
		return;

//	delta_send_packets = timer_read_delta_us(); // Check jitter near BEGINNING of interrupt (e.g. 5024...5052us)

	// Change to the next (non-ignored) channel
	if (beken.fcc.test_mode)
	{
		UpdateFccScan();
		BK2425_ChangeChannel(beken.fcc.channel);
		txChannel = 0;
	}
	else
	{
		txChannel = NextChannelIndex(txChannel);
		BK2425_ChangeChannel(LookupChannel(txChannel));
	}
	FlushTx(); // Discard any buffered tx bytes
	BK2425_ClearAckOverflow();

	// Support sending binding packets
	if (beken.bind_packets)
	{
		beken.bind_packets--;
		BK2425_SwitchToIdleMode();
		ChangeAddressTx(1); // Binding address
		BK2425_SwitchToTxMode();
		UpdateTxBindData(false);
		beken.pktDataTx.channel = txChannel; // Tell the receiver where in the sequence this was broadcast from.
		beken.lastTxChannel = txChannel;
		Send_Packet(BK_WR_TX_PLOAD, (uint8_t *)&beken.pktDataTx, PACKET_LENGTH_TX_BIND);
		return;
	}
	else if (isDisconnected())
	{
		if (++bindTimer >= 7)
		{
			bindTimer = 0;
			BK2425_SwitchToIdleMode();
			ChangeAddressTx(1); // Binding address
			BK2425_SwitchToTxMode();
			UpdateTxBindData(true);
			beken.pktDataTx.channel = txChannel; // Tell the receiver where in the sequence this was broadcast from.
			beken.lastTxChannel = txChannel;
			delay_us(95); // Try to remove jitter. Now it is 0.5% locally instead of nearly 5%
//			delta_send_packets = timer_read_delta_us(); // Check jitter before transmission
			Send_Packet(BK_WR_TX_PLOAD, (uint8_t *)&beken.pktDataTx, PACKET_LENGTH_TX_BIND);
			return;
		}
		else // (try to remove jitter during search) if (bindTimer == 1)
		{
			BK2425_SwitchToIdleMode();
			ChangeAddressTx(0); // Unique address for this controls
		}
	}
	else if (bindTimer != 99) // Note: There will be slight jitter when moving into/out of telemetry range
	{
		bindTimer = 99;
		BK2425_SwitchToIdleMode();
		ChangeAddressTx(0); // Unique address for this controls
	}
	BK2425_SwitchToTxMode();
	UpdateTxData();
	beken.pktDataTx.channel = txChannel; // Tell the receiver where in the sequence this was broadcast from.
	beken.lastTxChannel = txChannel;
	beken.stats.lastTxPacketCount++;
	if (!beken.lastTxCwMode)
	{
//		delta_send_packets = timer_read_delta_us(); // Check jitter before transmission
#if SUPPORT_DEBUG_LOSE_BURST
		// Support losing several packets in a row
		static uint8_t cnt_lose_packets = 0;
		if (++cnt_lose_packets >= 100)
			cnt_lose_packets = 0;
		if (cnt_lose_packets < SUPPORT_DEBUG_LOSE_BURST)
			return;
#endif
#if SUPPORT_DEBUG_LOSE_FREQ || SUPPORT_DEBUG_LOSE_RANDOM
		static uint32_t cnt_random = 0;
		cnt_random = (cnt_random * 214013ul+2531011ul) & 0x7ffffffful; // Linear congruential pseudo random number generator
		uint16_t r = (cnt_random >> 16); // 0..32767 random number
#endif
#if SUPPORT_DEBUG_LOSE_RANDOM
		// Support losing several packets in a row
		if (SUPPORT_DEBUG_LOSE_RANDOM*328u > r) // Does this packet fail?
			return;
#endif
#if SUPPORT_DEBUG_LOSE_FREQ
		// Support losing several packets in a row
		uint8_t f = LookupChannel(txChannel);
		if ((f >= 20 && f <= 40))
		{
			if (SUPPORT_DEBUG_LOSE_FREQ*328u > r) // Does this packet fail?
				return;
		}
#endif
		Send_Packet(BK_WR_TX_PLOAD, (uint8_t *)&beken.pktDataTx, PACKET_LENGTH_TX_CTRL);
	}
}

// ----------------------------------------------------------------------------
/** Start sending binding packets for 5 seconds */
void beken_start_bind_send(void)
{
	beken.bind_packets = 200 * 5;
}

// ----------------------------------------------------------------------------
/** Start sending a control data packet */
void beken_start_send(void)
{
	//...
}

// ----------------------------------------------------------------------------
/** Start sending an FCC test packet */
void beken_start_FCC_test(void)
{
    beken.fcc.channel = CHANNEL_FCC_LOW;
    beken.fcc.power = 7;
    beken.fcc.test_mode = true;
}

// ----------------------------------------------------------------------------
/** Start sending an factory test packet */
void beken_start_factory_test(
	uint8_t test_mode) ///< The type of test to send.
{
	beken.fcc.factory_mode = test_mode;
	if (test_mode)
	{
		uint8_t freq = CHANNEL_COUNT_LOGICAL*CHANNEL_NUM_TABLES+(test_mode-1);
		SetChannelRange(freq, freq+1);
		beken_set_factory_address();
	}
}

// ----------------------------------------------------------------------------
/** Set the next FCC power */
void beken_next_FCC_power(void)
{
    beken.fcc.power = (beken.fcc.power+1) & 7;
}

// ----------------------------------------------------------------------------
/** Go into continuous carrier wave send mode or normal mode */
void beken_set_CW_mode(
	bool cw) ///< false=normal, true=carrier wave
{
    beken.fcc.CW_mode = cw;
}

// ----------------------------------------------------------------------------
/** Change the FCC channel */
void beken_change_FCC_channel(
	int8_t change) ///< ?
{
    switch (beken.fcc.channel) {
    case CHANNEL_FCC_LOW:
        beken.fcc.channel = change==1?CHANNEL_FCC_MID:CHANNEL_FCC_HIGH;
        break;
    case CHANNEL_FCC_MID:
        beken.fcc.channel = change==1?CHANNEL_FCC_HIGH:CHANNEL_FCC_LOW;
        break;
    default:
    case CHANNEL_FCC_HIGH:
        beken.fcc.channel = change==1?CHANNEL_FCC_LOW:CHANNEL_FCC_MID;
        break;
    }
}

// ----------------------------------------------------------------------------
/** Toggle the FCC scan */
void beken_FCC_toggle_scan(void)
{
	beken.fcc.scan_mode = !beken.fcc.scan_mode;
    if (!beken.fcc.scan_mode) {
        beken.fcc.channel = CHANNEL_FCC_LOW;
    }
}

// ----------------------------------------------------------------------------
/** Get the current tx power (for debug output) */
uint8_t get_tx_power(void)
{
	return beken.lastTxPower;
}

// ----------------------------------------------------------------------------
/** Get the current (FCC test mode) channel */
int8_t get_FCC_chan(void)
{
	if (beken.fcc.test_mode)
		return beken.fcc.channel;
	return -1; // We are not in fcc mode
}

// ----------------------------------------------------------------------------
/** Get the current FCC power */
uint8_t get_FCC_power(void)
{
	if (beken.fcc.test_mode)
		return beken.fcc.power;
	return 0;
}

// ----------------------------------------------------------------------------
/** get the send rate in PPS (packets per second) */
uint8_t get_send_pps(void)
{
	return beken.send_pps;
}

// ----------------------------------------------------------------------------
/** Return the most recently calculated packets per second value */
uint8_t get_telem_pps(void)
{
    return beken.telem_pps;
}

// ----------------------------------------------------------------------------
/** For Beken, return fake RSSI, as Beken cannot determine a value accurately. */
uint8_t get_telem_rssi(void)
{
	return 50;
}

// ----------------------------------------------------------------------------
#define MS_PER_SECOND 1000u // Number of ms in a second
#define DELTA_DIV_PPS 8u // (should be power of two)

void radio_set_pps_rssi(void)
{
	// Adjust for the time between calls to this routine
	static uint32_t lastTime = 0;
	uint32_t now = timer_get_ms();
	uint16_t delta = now-lastTime;
	if (delta > 2000)
		delta = 2000;
	if (delta < 100)
		delta = 100;
	delta /= DELTA_DIV_PPS; // Fit the intermediate values within 16 bits
	lastTime = now;
	// Find the difference in times
	beken.telem_pps = ((beken.stats.numTelemPackets - beken.last_stats.numTelemPackets) * (MS_PER_SECOND/DELTA_DIV_PPS)) / delta;
	beken.send_pps = ((beken.stats.numSentPackets - beken.last_stats.numSentPackets) * (MS_PER_SECOND/DELTA_DIV_PPS)) / delta;
	memcpy(&beken.last_stats, &beken.stats, sizeof(beken.last_stats));
	// Notify the drone
	gFwInfo[BK_INFO_PPS] = beken.telem_pps;
}

// ----------------------------------------------------------------------------
/** For debugging - tell us the current beken register values (from bank 0)
   This just prints it to the UART rather than to the console over WiFi */
#if FATCODE
void beken_DumpRegisters(void)
{
	uint8_t i;
	for (i = 0; i <= BK_FEATURE; ++i)
	{
		uint8_t len = 1;
		switch (i) {
			case 10: case 11: case 16: len = 5; break;
			case 24: case 25: case 26: case 27: len = 0; break;
			default: len = 1; break;
		};
		if (len == 1)
		{
			printf("Bank0reg%d : %x\r\n", i, SPI_Read_Reg(i));
		}
		else if (len == 5)
		{
			uint8_t data[5];
			spi_read_registers(i, &data[0], len);
			printf("Bank0reg%d : %x %x %x %x %x\r\n", i, data[0], data[1], data[2], data[3], data[4]);
		}
	}
	BK2425_SetRBank(1);
	for (i = IREG1_4; i <= IREG1_13; ++i)
	{
		uint8_t len = 4;
		uint8_t idx = Bank1_RegTable[0][i][0];
		uint8_t data[4];
		spi_read_registers(i, &data[0], len);
		printf("Bank1reg%d : %x %x %x %x\r\n", idx, data[0], data[1], data[2], data[3]);
	}
	BK2425_SetRBank(0);
}
#endif

// ----------------------------------------------------------------------------
/** Placeholder. On the beken chip the processing is done in interrupts instead. */
void radio_check_telem_packet(void)
{
}

/** @}*/

#endif
